* Расчёт на механические воздействия
** Исходные данные
#+NAME: input_data
| Параметр                     | Значение | Ед измерения | Откуда взято          |
|------------------------------+----------+--------------+-----------------------|
| Длина ПП                     |       90 | mm           | sst_report.txt        |
| Ширина ПП                    |       80 | mm           | sst_report.txt        |
| Толщина ПП                   |      1.5 | mm           | sst_report.txt        |
| Масса печатной платы без ЭРЭ |     19.6 | g            | mass.org              |
| Масса ЭРЭ                    |    166.5 | g            | Подсчитано ниже       |
| Масса печатной платы с ЭРЭ   |    186.1 | g            | Cумма двух предыдущих |
#+TBLFM: @7$2=@6$2 + @5$2

*** Масса ЭРЭ
#+NAME: IC_mass
| Designator                               | Mass of each, g | Num | Sum of mass,g |
|------------------------------------------+-----------------+-----+---------------|
| R1, R3...R6, R11,R12, R14, R15 (DIN0207) |           0.080 |   9 |          0.72 |
| R2, R13 (DIN0204)                        |           0.022 |   2 |         0.044 |
| R7...R10 (P015N)                         |            35.9 |   4 |         143.6 |
| C1                                       |            0.56 |   1 |          0.56 |
| C2                                       |            0.38 |   1 |          0.38 |
| C3                                       |            0.23 |   1 |          0.23 |
| C4, C5                                   |            0.01 |   2 |          0.02 |
| DA1                                      |             2.5 |   1 |           2.5 |
| DD1                                      |               4 |   1 |             4 |
| HA1                                      |               2 |   1 |             2 |
| HL1                                      |             0.4 |   1 |           0.4 |
| SA1                                      |            0.22 |   1 |          0.22 |
| SA2                                      |            0.49 |   1 |          0.49 |
| VD1                                      |             0.4 |   1 |           0.4 |
| VD2                                      |            0.15 |   1 |          0.15 |
| VD3                                      |          0.4536 |   1 |        0.4536 |
| VT1                                      |             0.3 |   1 |           0.3 |
| X1                                       |             0.3 |   1 |           0.3 |
| X2                                       |               2 |   1 |             2 |
| X3, X5                                   |            0.86 |   2 |          1.72 |
| X4                                       |               5 |   1 |             5 |
| ZQ1                                      |               1 |   1 |             1 |
|------------------------------------------+-----------------+-----+---------------|
| Total mass                               |                 |     |      166.4876 |
#+TBLFM: $4=$2 * $3::@24$4=vsum(@2..@23)
